transforms:
  api-alert:
    type: exclusive_route
    inputs:
      - api.alert
    routes:
      - name: resolve
        condition: '%http_server.query_parameters.action == "resolve"'

  ocsf-alert-closed:
    type: remap
    inputs:
      - api-alert.resolve
    source: |
      %ocsf = true
      now = now()
      path = split(%http_server.path, "/") ?? []
      ocsf = {"metadata": {"version": "1.3.0",
                     "product": {"vendor_name": "CrowdAlert",
                                 "name": "StrIEM"},
                     "uid": uuid_v7(),
                     "correlation_uid": path[2],
                     "profiles": ["datetime"]},
        "time": to_unix_timestamp(now, "milliseconds"),
        "category_uid": 2,
        "category_name": "Findings",
        "class_uid": 2004,
        "class_name": "Detection Finding",
        "type": 200403,
        "type_name": "Detection Finding: Close",
        "status": "Resolved",
        "status_id": 4,
        "severity_id": 1,
        "severity": "Informational",
        "activity_id": 3,
        "activity_name": "Close"}

        ocsf.time_dt, _ = format_timestamp(now, format: "%+")
        ocsf.comment, _ = to_string(.)
        . = compact(ocsf)
